artillery.yml
config:
  target: "http://localhost:5001"
  phases:
    - duration: 30
      arrivalRate: 10
      name: "Warm up"
    - duration: 60
      arrivalRate: 50
      name: "Peak load — 50 concurrent users"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Feed browsing"
    flow:
      - get:
          url: "/api/notes?page=1&limit=10"
      - get:
          url: "/api/placements?page=1&limit=10"
      - get:
          url: "/api/posts?scope=kalvium&limit=10"
      - get:
          url: "/api/search?q=DSA"